TsonduLi/pendulum-oscillation-control-state-estimation/lab3/PIC32_SPI_HAL_Starter.c
    // pSPICON->SS = 1
    // pSPICON->ON = 1
  }
  return ReturnVal;
}

/****************************************************************************
 Function
    SPISetup_SetLeader

 Description
   Sets the selected SPI Module to leader mode, configures the SPI CLK 
   pin as an output, and sets the input sample phase. 
   NOTE: 1) Either this function or the SPISetup_SetFollower function should 
   be called immediately after the call to SPISetup_BasicConfig. 
   2) the PIC32 documentation refers to this mode as master mode.
****************************************************************************/
bool SPISetup_SetLeader(SPI_Module_t WhichModule, SPI_SamplePhase_t WhichPhase)
{
  bool ReturnVal = true;
    if (!isSPI_ModuleLegal(WhichModule)||
  ((WhichPhase != SPI_SMP_MID) && (WhichPhase != SPI_SMP_END))){
    ReturnVal = false;
    }else{
//      pSPICON->ON = 0;
      pSPICON->MSSEN = 1;
      pSPICON->SMP = WhichPhase;   // set sample phase
      SPI_PinMap_t SCK_Pin;
      if (SPI_SPI1 == WhichModule){
      SCK_Pin = SPI_RPB14; 
    }else {
      SCK_Pin = SPI_RPB15;
    }
    *setTRISRegisters[SCK_Pin] = mapPinMap2BitPosn[SCK_Pin];
    *clrANSELRegisters[SCK_Pin] = mapPinMap2BitPosn[SCK_Pin];

      // pSPICON->SS = 1
//      pSPICON->ON = 1;
    }
  return ReturnVal;
}

/****************************************************************************
 Function
    SPISetup_SetBitTime

 Description
   Based on a 20MHz PBCLK, calculates and programs the SPIBRG register for the
   specified SPI module to achieve the requested bit time.
****************************************************************************/
bool SPISetup_SetBitTime(SPI_Module_t WhichModule, uint32_t SPI_ClkPeriodIn_ns)
{
 bool ReturnVal = true;
 if (!isSPI_ModuleLegal(WhichModule)){
   ReturnVal = false;
   }else{
     *pSPIBRG = (20 * SPI_ClkPeriodIn_ns/1000)/2 -1;
   }
 return ReturnVal;
}

/****************************************************************************
 Function
    SPISetup_MapSSInput

 Description
   Sets the designated pin to be the SS input if the selected SPI Module
   is configured in Follower mode. 
   Legal port pins for the SS1 input are:
   SPI_RPA0, SPI_RPB3, SPI_RPB4, SPI_RPB7,SPI_RPB15.
   Legal port pins for the SS2 input are:
   SPI_RPA3, SPI_RPB0, SPI_RPB9, SPI_RPB10,SPI_RPB14.
****************************************************************************/
bool SPISetup_MapSSInput(SPI_Module_t WhichModule, SPI_PinMap_t WhichPin)
{
  // not needed for ME218a Labs
}

/****************************************************************************
 Function
    SPISetup_MapSSOutput

 Description
   Sets the designated pin to be the SS output if the selected SPI Module
   is configured in Leader mode. Clears TRIS and ANSEL to make pin an output.
   Also configures INT4/INT1 to monitor for rising edges on the SS output pin.
   Legal port pins for the SS1 output are:
   SPI_NO_PIN, SPI_RPA0, SPI_RPB3, SPI_RPB4, SPI_RPB7,SPI_RPB15.
   Legal port pins for the SS2 output are:
   SPI_NO_PIN, SPI_RPA3, SPI_RPB0, SPI_RPB9, SPI_RPB10,SPI_RPB14.
****************************************************************************/
bool SPISetup_MapSSOutput(SPI_Module_t WhichModule, SPI_PinMap_t WhichPin)
{
  bool ReturnVal = true;
  
  // Make sure that we have a legal module specified & legal pin
  if ( (false == isSPI_ModuleLegal(WhichModule)) || 
       (false == isSS_OutputPinLegal(WhichModule, WhichPin)) )
  {
    ReturnVal = false;
  }else 
  { // Legal module  & pin so set try setting it up
    selectModuleRegisters(WhichModule);
    if (1 == pSPICON->MSTEN)  // configured in Leader mode?
    {
      if (SPI_NO_PIN == WhichPin)
      {
        pSPICON->MSSEN = 0; // disable SS
      }else //there is an SS pin so map it
      {
        pSPICON->MSSEN = 1; // enable SS
        // clear the TRIS bit to make it an output
        *clrTRISRegisters[WhichPin] = mapPinMap2BitPosn[WhichPin];
        // clear the ANSEL bit to disable analog on the pin
        *clrANSELRegisters[WhichPin] = mapPinMap2BitPosn[WhichPin];
            
        if (SPI_SPI1 == WhichModule)
        {
          *outputMapRegisters[WhichPin] = MAP_SS1; // Map SS to chosen pin
          // set up to use INT4 to capture the rising edge of SS
          INTCONbits.INT4EP = 1;            // set for rising edge sensitivity  //rising edge (1) or a falling edge (0)
          IFS0CLR = _IFS0_INT4IF_MASK;      // clear any pending flag
          INT4R = mapPinMap2INTConst[WhichPin];  // map INT4 to SS as well
        }else  
        {   // must be SPI2 so set up INT1
          *outputMapRegisters[WhichPin] = MAP_SS2; // Map SS to chosen pin
          // set up to use INT1 to capture the rising edge of SS
          INTCONbits.INT1EP = 1;            // set for rising edge sensitivity
          IFS0CLR = _IFS0_INT1IF_MASK;      // clear any pending flag
          INT1R = mapPinMap2INTConst[WhichPin];  // map INT1 to SS as well
        }
      }
    }else // not in Leader mode
    {
      ReturnVal = false; // then we can't config an SS output
    }
  }
  return ReturnVal;
}
/****************************************************************************
 Function
    SPISetup_MapSDInput

 Description
   Sets the designated pin to be the SD input.
   Legal port pins for the SDI1 input are:
   SPI_NO_PIN, SPI_RPA1, SPI_RPB1, SPI_RPB5, SPI_RPB8,SPI_RPB11.   
   Legal port pins for the SDI2 input are:
   SPI_NO_PIN, SPI_RPA2, SPI_RPA4, SPI_RPB2, SPI_RPB6,SPI_RPB13.   
****************************************************************************/
bool SPISetup_MapSDInput(SPI_Module_t WhichModule, SPI_PinMap_t WhichPin)
{
  // not needed for ME218a Labs
}

/****************************************************************************
 Function
    SPISetup_MapSDOutput

 Description
   Sets the designated pin to be the SD output. 
****************************************************************************/
bool SPISetup_MapSDOutput(SPI_Module_t WhichModule, SPI_PinMap_t WhichPin)
{
  bool ReturnVal = true;
    // Make sure that we have a legal module specified & legal pin
  if ( (false == isSPI_ModuleLegal(WhichModule)) || 
       (false == isSDOPinLegal(WhichPin)) )
  {
    ReturnVal = false;
  }else 
  { // Legal module  & pin so set try setting it up
    selectModuleRegisters(WhichModule);
    if (SPI_NO_PIN == WhichPin)
    {
      pSPICON->DISSDO = 1; 
      ReturnVal = false;
    }else //there is an SS pin so map it
    {
      //There’s no need for a separate enable flag or additional logic like SS, 
      //because SDO is just an output pin that sends data in sync with the SPI clock.
       // Enable SDO pin
      pSPICON->DISSDO = 0;
      // clear the TRIS bit to make it an output
      *clrTRISRegisters[WhichPin] = mapPinMap2BitPosn[WhichPin];
      // clear the ANSEL bit to disable analog on the pin
      *clrANSELRegisters[WhichPin] = mapPinMap2BitPosn[WhichPin];
          
      if (SPI_SPI1 == WhichModule)
      {
        *outputMapRegisters[WhichPin] = MAP_SDO1; // Map SDO to chosen pin
      }else  
      {   // must be SPI2 so set up INT1
        *outputMapRegisters[WhichPin] = MAP_SDO2; // Map SDO to chosen pin
      }
    }
  }
  return ReturnVal;
}

/****************************************************************************
 Function
    SPISetup_SetClockIdleState

 Description
   Sets the idle state of the SPI clock. 
****************************************************************************/
bool SPISetup_SetClockIdleState(SPI_Module_t WhichModule, 
                                SPI_Clock_t WhichState)
{
  bool ReturnVal = true;
  if (!isSPI_ModuleLegal(WhichModule)){
    ReturnVal = false;
  }else{
    selectModuleRegisters(WhichModule);
    pSPICON->ON = 0;
    pSPICON->CKP = WhichState;
    pSPICON->ON = 1; // Re-enable
  }
  return ReturnVal;
  
